/*****************************************************************************
*  8x8時脈系統.
*
*  created  by channel
*
*  todo list:
*
*  note:
****************************************************************************/

#include "Game8x8Time.h"

//---------------------------------------------------------------------------
// 建構式.
//---------------------------------------------------------------------------
Game8x8Time::Game8x8Time() {
}

//---------------------------------------------------------------------------
// 更新.
// tick:啟動的時間.
//  cls:每次啟動後清除時脈.
//---------------------------------------------------------------------------
bool Game8x8Time::update(unsigned long tick, bool cls = true) {		
	timeTick += millis() - timeTemp;
	timeTemp = millis();

	if (timeTick >= tick) {
		timeTick -= tick;
		if (cls) { timeTick = 0; }
		return true;
	}
	else {
		return false;
	}
}

